### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.lambda_function.data.aws_iam_policy_document.logs[0] will be read during apply
 <= data "aws_iam_policy_document" "logs" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "logs:CreateLogGroup",
+               "logs:CreateLogStream",
+               "logs:PutLogEvents",
            ]
+           effect    = "Allow"
+           resources = (known after apply)
        }
    }

  # module.lambda_function.aws_cloudwatch_log_group.lambda[0] must be replaced
-/+ resource "aws_cloudwatch_log_group" "lambda" {
!       arn               = "arn:aws:logs:us-east-1:350131064538:log-group:/aws/lambda/cataprato-core-lambda" -> (known after apply)
!       id                = "/aws/lambda/cataprato-core-lambda" -> (known after apply)
!       name              = "/aws/lambda/cataprato-core-lambda" -> "/aws/lambda/core"
+       name_prefix       = (known after apply)
        tags              = {
            "Deployment" = "terraform"
        }
        # (3 unchanged attributes hidden)
    }

  # module.lambda_function.aws_iam_policy.additional_inline[0] must be replaced
-/+ resource "aws_iam_policy" "additional_inline" {
!       arn         = "arn:aws:iam::350131064538:policy/tf-managed/cataprato-core-lambda-inline" -> (known after apply)
!       id          = "arn:aws:iam::350131064538:policy/tf-managed/cataprato-core-lambda-inline" -> (known after apply)
!       name        = "cataprato-core-lambda-inline" -> "core-inline"
+       name_prefix = (known after apply)
!       policy_id   = "ANPAVDBLQB3NFZYVHQBDP" -> (known after apply)
        tags        = {
            "Deployment" = "terraform"
        }
        # (3 unchanged attributes hidden)
    }

  # module.lambda_function.aws_iam_policy.logs[0] must be replaced
-/+ resource "aws_iam_policy" "logs" {
!       arn         = "arn:aws:iam::350131064538:policy/tf-managed/cataprato-core-lambda-logs" -> (known after apply)
!       id          = "arn:aws:iam::350131064538:policy/tf-managed/cataprato-core-lambda-logs" -> (known after apply)
!       name        = "cataprato-core-lambda-logs" -> "core-logs"
+       name_prefix = (known after apply)
!       policy      = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "logs:PutLogEvents",
-                           "logs:CreateLogStream",
-                           "logs:CreateLogGroup",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:logs:us-east-1:350131064538:log-group:/aws/lambda/cataprato-core-lambda:*:*",
-                           "arn:aws:logs:us-east-1:350131064538:log-group:/aws/lambda/cataprato-core-lambda:*",
                        ]
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> (known after apply)
!       policy_id   = "ANPAVDBLQB3NJU2P3YDUN" -> (known after apply)
        tags        = {
            "Deployment" = "terraform"
        }
        # (2 unchanged attributes hidden)
    }

  # module.lambda_function.aws_iam_role.lambda[0] must be replaced
-/+ resource "aws_iam_role" "lambda" {
!       arn                   = "arn:aws:iam::350131064538:role/tf-managed/cataprato-core-lambda" -> (known after apply)
!       create_date           = "2023-08-09T15:02:39Z" -> (known after apply)
!       id                    = "cataprato-core-lambda" -> (known after apply)
!       managed_policy_arns   = [
-           "arn:aws:iam::350131064538:policy/tf-managed/cataprato-core-lambda-inline",
-           "arn:aws:iam::350131064538:policy/tf-managed/cataprato-core-lambda-logs",
        ] -> (known after apply)
!       name                  = "cataprato-core-lambda" -> "core"
+       name_prefix           = (known after apply)
        tags                  = {
            "Deployment" = "terraform"
        }
!       unique_id             = "AROAVDBLQB3NMQ4C4YMML" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function.aws_iam_role_policy_attachment.additional_inline[0] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "additional_inline" {
!       id         = "cataprato-core-lambda-20230815030216551000000001" -> (known after apply)
!       policy_arn = "arn:aws:iam::350131064538:policy/tf-managed/cataprato-core-lambda-inline" -> (known after apply)
!       role       = "cataprato-core-lambda" -> "core"
    }

  # module.lambda_function.aws_iam_role_policy_attachment.logs[0] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "logs" {
!       id         = "cataprato-core-lambda-20230809150239673200000002" -> (known after apply)
!       policy_arn = "arn:aws:iam::350131064538:policy/tf-managed/cataprato-core-lambda-logs" -> (known after apply)
!       role       = "cataprato-core-lambda" -> "core"
    }

  # module.lambda_function.aws_lambda_function.this[0] must be replaced
-/+ resource "aws_lambda_function" "this" {
!       arn                            = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-core-lambda" -> (known after apply)
!       function_name                  = "cataprato-core-lambda" -> "core"
!       id                             = "cataprato-core-lambda" -> (known after apply)
!       invoke_arn                     = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-core-lambda/invocations" -> (known after apply)
!       last_modified                  = "2023-08-17T21:00:36.000+0000" -> (known after apply)
!       qualified_arn                  = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-core-lambda:17" -> (known after apply)
!       qualified_invoke_arn           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:350131064538:function:cataprato-core-lambda:17/invocations" -> (known after apply)
!       role                           = "arn:aws:iam::350131064538:role/tf-managed/cataprato-core-lambda" -> (known after apply)
+       signing_job_arn                = (known after apply)
+       signing_profile_version_arn    = (known after apply)
!       source_code_hash               = "Vo1Wjc4YLcCaw1TtrgWrNjUIrRpfzpG0WPEjfR0ATsM=" -> (known after apply)
!       source_code_size               = 38811 -> (known after apply)
        tags                           = {
            "Deployment" = "terraform"
        }
!       version                        = "17" -> (known after apply)
        # (15 unchanged attributes hidden)

-       tracing_config {
-           mode = "PassThrough" -> null
        }

        # (2 unchanged blocks hidden)
    }

  # module.lambda_function.aws_lambda_function_url.this[0] must be replaced
-/+ resource "aws_lambda_function_url" "this" {
!       function_arn       = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-core-lambda" -> (known after apply)
!       function_name      = "cataprato-core-lambda" -> "core"
!       function_url       = "https://7ltelrtxcwm426yakty7myqwye0zxunl.lambda-url.us-east-1.on.aws/" -> (known after apply)
!       id                 = "cataprato-core-lambda" -> (known after apply)
!       url_id             = "7ltelrtxcwm426yakty7myqwye0zxunl" -> (known after apply)
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.lambda_function.aws_lambda_permission.current_version_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
!       function_name       = "cataprato-core-lambda" -> "core"
!       id                  = "APIGatewayAny" -> (known after apply)
!       qualifier           = "17" -> (known after apply)
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["APIGatewayAny"] must be replaced
-/+ resource "aws_lambda_permission" "unqualified_alias_triggers" {
!       function_name       = "cataprato-core-lambda" -> "core"
!       id                  = "APIGatewayAny" -> (known after apply)
+       statement_id_prefix = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.lambda_function.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "6935811173273940328" -> (known after apply)
!       triggers = {
!           "timestamp" = "1692305961834180200" -> "1692416106406220000"
            # (1 unchanged element hidden)
        }
    }

  # module.lambda_layer_s3.null_resource.archive[0] must be replaced
-/+ resource "null_resource" "archive" {
!       id       = "8978777818476827499" -> (known after apply)
!       triggers = {
!           "timestamp" = "1692305966202656000" -> "1692416110000397000"
            # (1 unchanged element hidden)
        }
    }

Plan: 12 to add, 0 to change, 12 to destroy.
```
</details>